## Use `brew bundle` to run

# Taps
tap "homebrew/bundle"

# Development
brew "bash"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "mas"
brew "tree"
brew "virtualenv"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "1password-cli"
cask "adobe-digital-editions"
cask "bambu-studio"
cask "colorsnapper"
cask "docker"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "maccy"
cask "name-mangler"
cask "obsidian"
cask "pika"
cask "rectangle"
cask "signal"
cask "sketch"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "visual-studio-code"

# Fonts (Modernized for Homebrew Cask)
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-barlow"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-ubuntu"
cask "font-source-code-pro"

# Mac App Store (Requires 'mas' to be installed)
mas "Goodnotes", id: 1444383602
mas "PDF Squeezer", id: 1502111349