## Use `brew bundle` to run

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'mongodb/brew'

# Development
brew 'autojump' # shell extension
brew 'bash' 
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'tree'
brew 'virtualenv'
brew 'wget'
brew 'zsh' 
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
# brew 'go'
# brew 'htop'
# brew 'jupyterlab'
# brew 'mysql', restart_service: true
# brew 'svn'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-digital-editions'
cask 'colorsnapper'
cask 'docker'
cask 'dropbox'
cask 'hiddenbar'
cask 'google-chrome'
cask 'iterm2'
cask 'maccy'
cask 'name-mangler'
cask 'notable'
cask 'rectangle'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'telegram-desktop'
cask 'visual-studio-code'
# cask 'vlc'

# Fonts
cask 'font-barlow-condensed'
cask 'font-barlow-semi-condensed'
cask 'font-barlow'
cask 'font-consolas-for-powerline'
cask 'font-lato'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg'
cask 'font-open-sans'
cask 'font-overpass'
cask 'font-overpass-mono'
cask 'font-palanquin'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu'
cask 'font-ubuntu-mono'
cask 'font-varela'
cask 'font-varela-round'

# Mac App Store
mas 'GoodNotes 5', id: 1444383602
mas 'PDF Squeezer 4', id: 1502111349